Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИтогиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.Закупки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>InformationRegister.ЦеныПоступления</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.РегистрУправленческий</xr:Item>
				<xr:Item>AccountingRegister.Хозяйственный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоровыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты()
	Возврат Константы.РасчитатьСтоимостьАвтоматически.Получить();
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСтоимостьАвтоматически = ПолучитьЗначениеКонстанты();	
	Если РасчитатьСтоимостьАвтоматически = Истина  Тогда
		 Элементы.Товары.ТекущиеДанные.Стоимость = Элементы.Товары.ТекущиеДанные.ЦенаПоступления * 
		 										   Элементы.Товары.ТекущиеДанные.Количество;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаша(Команда)
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ТоварыПередУдалениемНаСервере(ТекДокумент,Товар)
	ЗаписьЖурналаРегистрации("ПоступлениеТоваров.УдалениеСтроки",УровеньЖурналаРегистрации.Информация,,ТекДокумент,"Удаление номенклатуры из документа "+Товар);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	ТД = Элементы.Товары.ТекущиеДанные;
	Товар = ТД.Номенклатура;
	ТоварыПередУдалениемНаСервере(Объект.Ссылка,Товар);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ЗаписатьИнформациюВЖурнал(ТекДокумент,Товар,СтараяЦена,НоваяЦена)
	 ЗаписьЖурналаРегистрации("ПоступлениеТоваров.ИзменениеЦеныПоступления",   УровеньЖурналаРегистрации.Информация,,ТекДокумент ,
	"Изменение цены по товару "+Товар+" старая цена " +СтараяЦена+ " новая цена " + НоваяЦена);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	ТД = Элементы.Товары.ТекущиеДанные;
	Товар = ТД.Номенклатура;
	НоваяЦена = ТД.ЦенаПоступления;
	ЗаписатьИнформациюВЖурнал(Объект.Ссылка,Товар,СтараяЦена,НоваяЦена);
	СтараяЦена = НоваяЦена;
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму()

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Стоимость = ОбщееНазначение.РасчитатьСуммуТабличнойЧасти(ТекущиеДанные.Количество,ТекущиеДанные.ЦенаПоступления);

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	СтараяЦена = Элементы.Товары.ТекущиеДанные.ЦенаПоступления;  
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НесколькоСкладов = Константы.НесколькоСкладов.Получить();
	Если НесколькоСкладов Тогда
		Объект.Склад = Константы.СкладПоУмолчанию.Получить(); 
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПояснениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;  
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ЗначениеПояснения = ТекущаяСтрока.Пояснение;

	ПараметрыВвода = Новый Структура("ПриемникПояснения",ЗначениеПояснения);
	
	ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаВводаПояснения",ПараметрыВвода,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры
 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Дата = НачалоМесяца(Объект.Дата);
КонецПроцедуры
